#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/5306e752-04d8-4db5-a7af-224ea16c28fd/terraform-bin show -no-color plan.tmp

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_object.redirects["/commands/update/drop-all.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/update/drop-all.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/commands/maintenance/drop-all.html"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_s3_object.redirects["/commands/update/drop-all.html"] will be created%0A  + resource "aws_s3_object" "redirects" {%0A      + acl                    = (known after apply)%0A      + bucket                 = "stage-docsstageliquibasecom-origin"%0A      + bucket_key_enabled     = (known after apply)%0A      + checksum_crc32         = (known after apply)%0A      + checksum_crc32c        = (known after apply)%0A      + checksum_sha1          = (known after apply)%0A      + checksum_sha256        = (known after apply)%0A      + content_type           = "text/html"%0A      + etag                   = (known after apply)%0A      + force_destroy          = false%0A      + id                     = (known after apply)%0A      + key                    = "/commands/update/drop-all.html"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + storage_class          = (known after apply)%0A      + tags_all               = (known after apply)%0A      + version_id             = (known after apply)%0A      + website_redirect       = "/commands/maintenance/drop-all.html"%0A    }%0A%0APlan: 1 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>


*Pusher: @AMBERMW13, Action: `pull_request`, Working Directory: `/home/runner/work/liquibase-docs/liquibase-docs`, Workflow: `Publish Redirects to Staging for Docs`*